app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "post title"], ["content", "post content"], ["user_id", 1], ["created_at", "2015-03-25 21:28:13.605521"], ["updated_at", "2015-03-25 21:28:13.605521"]]
---
  def create
    # binding.pry
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save